app/views/divesites/index.html.erb

SELECT "divesites".* FROM "divesites" INNER JOIN "divesite_locations" ON "divesites"."id" = "divesite_locations"."divesite_id" WHERE "divesite_locations"."location_id" = ?  [["location_id", 1]]
---
        <ul class="site-list" >
          <% @location.divesites.each do |divesite| %>