app/views/divesites/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."divesite_id" = ?  [["divesite_id", 76]]
---
      <% else %>
        <% @divesite.reviews.each do |review| %>