app/controllers/divesites_controller.rb

  def show
    @divesite = Divesite.find_by(id: params[:id])
---
SELECT  "divesites".* FROM "divesites" WHERE "divesites"."id" = ? LIMIT 1  [["id", 76]]