app/controllers/reviews_controller.rb

  def new
    if logged_in?
      @user = current_user
      @divesite = Divesite.find_by(id: params[:divesite_id])
---
SELECT  "divesites".* FROM "divesites" WHERE "divesites"."id" = ? LIMIT 1  [["id", 77]]

  def create
    @divesite = Divesite.find(params[:divesite_id])
    @user = current_user
    review = Review.create(review_params)
    review.update(user_id: current_user.id)
---
SELECT  "divesites".* FROM "divesites" WHERE "divesites"."id" = ? LIMIT 1  [["id", 142]]
INSERT INTO "reviews" ("title", "rating", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This place is awesome"], ["rating", 4], ["body", "It's full of water and fish"], ["created_at", "2016-04-09 01:07:43.313987"], ["updated_at", "2016-04-09 01:07:43.313987"]]
UPDATE "reviews" SET "divesite_id" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["divesite_id", 67], ["updated_at", "2016-04-09 01:08:05.119087"], ["id", 3]]

  def edit
    @divesite = Divesite.find(params[:divesite_id])
    @review = Review.find(params[:id])
---
SELECT  "divesites".* FROM "divesites" WHERE "divesites"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 14]]

  def update
    @divesite = Divesite.find(params[:divesite_id])
    @review = Review.find(params[:id])
    @review.update(review_params)
---
SELECT  "divesites".* FROM "divesites" WHERE "divesites"."id" = ? LIMIT 1  [["id", 142]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "reviews" SET "rating" = ?, "body" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 1], ["body", "The whole place is underwater. It's amazing!!! I saw a fish"], ["updated_at", "2016-04-09 15:04:38.468491"], ["id", 14]]

  def destroy
    @divesite = Divesite.find(params[:divesite_id])
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  "divesites".* FROM "divesites" WHERE "divesites"."id" = ? LIMIT 1  [["id", 142]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 13]]