app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "username", "password_hash", "first_name", "last_name", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    if session[:user_id] == params[:id].to_i
     @user = User.find_by(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE (1) LIMIT 1